Revit 2027 API
ParameterDownloadOptions.GetCategories Method
 Get categories for binding.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCategories()
Public Function GetCategories As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCategories()
member GetCategories : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace